backend/tests/load/auth-residence-load.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Échauffement"
    - duration: 120
      arrivalRate: 10
      rampTo: 20
      name: "Montée en charge"
    - duration: 60
      arrivalRate: 20
      name: "Charge soutenue"
  environments:
    production:
      target: "https://api.chapechape-residences.com"
      phases:
        - duration: 300
          arrivalRate: 50
          rampTo: 100
          name: "Test de production"
  plugins:
    metrics-by-endpoint: {}

scenarios:
  - name: "Parcours de navigation résidences"
    weight: 7
    flow:
      # Récupérer le token CSRF
      - get:
          url: "/api/csrf-token"
          capture:
            - json: "$.csrfToken"
              as: "csrfToken"
      
      # Voir la liste des résidences
      - get:
          url: "/api/residences"
          headers:
            X-CSRF-TOKEN: "{{ csrfToken }}"
          capture:
            - json: "$[0].id"
              as: "residenceId"
      
      # Voir les détails d'une résidence
      - get:
          url: "/api/residences/{{ residenceId }}"
          headers:
            X-CSRF-TOKEN: "{{ csrfToken }}"
      
      # Pause pour simuler la lecture
      - think: 5
      
      # Rechercher des résidences
      - get:
          url: "/api/residences?location=Paris&checkIn=2025-09-01&checkOut=2025-09-05&guests=2"
          headers:
            X-CSRF-TOKEN: "{{ csrfToken }}"

  - name: "Parcours d'authentification"
    weight: 3
    flow:
      # Récupérer le token CSRF
      - get:
          url: "/api/csrf-token"
          capture:
            - json: "$.csrfToken"
              as: "csrfToken"
      
      # Tentative de login avec données aléatoires
      - post:
          url: "/api/auth/login"
          headers:
            X-CSRF-TOKEN: "{{ csrfToken }}"
            Content-Type: "application/json"
          json:
            email: "user{{ $randomNumber(1, 1000) }}@example.com"
            password: "Password{{ $randomString(8) }}"